{
    "id": 1063155,
    "name": "PCI-DSS4-Requirement-6.2.4 - Software engineering techniques or other methods are defined and in use by software development personnel to prevent or mitigate common software attacks and related vulnerabilities",
    "href": "CARL/technical-criteria/1063155",
    "description": "Purpose\nDetecting or preventing common errors that result in vulnerable code as early as possible in the software development process lowers the probability that such errors make it through to production and lead to a compromise. Having formal engineering techniques and tools embedded in the development process will catch these errors early. This philosophy is sometimes called “shifting security left.”\n\nGood Practice\nFor both bespoke and custom software, the entity must ensure that code is developed focusing on the prevention or mitigation of common software attacks, including:\n• Attempts to exploit common coding vulnerabilities (bugs).\n• Attempts to exploit software design flaws.\n• Attempts to exploit implementation/configuration flaws.\n• Enumeration attacks – automated attacks that are actively exploited in payments and abuse identification, authentication, or authorization mechanisms. See the PCI Perspectives blog article “Beware of Account Testing Attacks.”\nResearching and documenting software engineering techniques or other methods helps to define how software developers prevent or mitigate various software attacks by features or countermeasures they build into software. This might include identification/authentication mechanisms, access control, input validation routines, etc. Developers should be familiar with different types of vulnerabilities and potential attacks and use measures to avoid potential attack vectors when developing code. \nExamples\nTechniques include automated processes and practices that scan code early in the development cycle when code is checked in to confirm the vulnerabilities are not present.",
    "qualityRules": {
        "name": "Quality Rules in numeric ID order",
        "href": "CARL/technical-criteria/1063155/quality-rules"
    }
}
